---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternColor
source: html/4b9428fc-1822-3cf4-1376-b4a74bd05c06.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternColor Property

The override color of the surface foreground pattern.

## Syntax (C#)
```csharp
public Color SurfaceForegroundPatternColor { get; }
```